grevaillot/svd_tools/headers/ATSAMV71Q19/pioc.h
#pragma once 

/* --- PIOC: Parallel Input/Output Controller ----------------------- */

/** @defgroup pioc_registers Parallel Input/Output Controller Register
@{*/

/** PIOC_PIO_PER PIO Enable Register **/
#define PIOC_PIO_PER			MMIO32(PIOC_BASE + 0x00)
/** PIOC_PIO_PDR PIO Disable Register **/
#define PIOC_PIO_PDR			MMIO32(PIOC_BASE + 0x04)
/** PIOC_PIO_PSR PIO Status Register **/
#define PIOC_PIO_PSR			MMIO32(PIOC_BASE + 0x08)
/** PIOC_PIO_OER Output Enable Register **/
#define PIOC_PIO_OER			MMIO32(PIOC_BASE + 0x10)
/** PIOC_PIO_ODR Output Disable Register **/
#define PIOC_PIO_ODR			MMIO32(PIOC_BASE + 0x14)
/** PIOC_PIO_OSR Output Status Register **/
#define PIOC_PIO_OSR			MMIO32(PIOC_BASE + 0x18)
/** PIOC_PIO_IFER Glitch Input Filter Enable Register **/
#define PIOC_PIO_IFER			MMIO32(PIOC_BASE + 0x20)
/** PIOC_PIO_IFDR Glitch Input Filter Disable Register **/
#define PIOC_PIO_IFDR			MMIO32(PIOC_BASE + 0x24)
/** PIOC_PIO_IFSR Glitch Input Filter Status Register **/
#define PIOC_PIO_IFSR			MMIO32(PIOC_BASE + 0x28)
/** PIOC_PIO_SODR Set Output Data Register **/
#define PIOC_PIO_SODR			MMIO32(PIOC_BASE + 0x30)
/** PIOC_PIO_CODR Clear Output Data Register **/
#define PIOC_PIO_CODR			MMIO32(PIOC_BASE + 0x34)
/** PIOC_PIO_ODSR Output Data Status Register **/
#define PIOC_PIO_ODSR			MMIO32(PIOC_BASE + 0x38)
/** PIOC_PIO_PDSR Pin Data Status Register **/
#define PIOC_PIO_PDSR			MMIO32(PIOC_BASE + 0x3c)
/** PIOC_PIO_IER Interrupt Enable Register **/
#define PIOC_PIO_IER			MMIO32(PIOC_BASE + 0x40)
/** PIOC_PIO_IDR Interrupt Disable Register **/
#define PIOC_PIO_IDR			MMIO32(PIOC_BASE + 0x44)
/** PIOC_PIO_IMR Interrupt Mask Register **/
#define PIOC_PIO_IMR			MMIO32(PIOC_BASE + 0x48)
/** PIOC_PIO_ISR Interrupt Status Register **/
#define PIOC_PIO_ISR			MMIO32(PIOC_BASE + 0x4c)
/** PIOC_PIO_MDER Multi-driver Enable Register **/
#define PIOC_PIO_MDER			MMIO32(PIOC_BASE + 0x50)
/** PIOC_PIO_MDDR Multi-driver Disable Register **/
#define PIOC_PIO_MDDR			MMIO32(PIOC_BASE + 0x54)
/** PIOC_PIO_MDSR Multi-driver Status Register **/
#define PIOC_PIO_MDSR			MMIO32(PIOC_BASE + 0x58)
/** PIOC_PIO_PUDR Pull-up Disable Register **/
#define PIOC_PIO_PUDR			MMIO32(PIOC_BASE + 0x60)
/** PIOC_PIO_PUER Pull-up Enable Register **/
#define PIOC_PIO_PUER			MMIO32(PIOC_BASE + 0x64)
/** PIOC_PIO_PUSR Pad Pull-up Status Register **/
#define PIOC_PIO_PUSR			MMIO32(PIOC_BASE + 0x68)
/** PIOC_PIO_ABCDSR[0] Peripheral ABCD Select Register 0 **/
#define PIOC_PIO_ABCDSR[0]			MMIO32(PIOC_BASE + 0x70)
/** PIOC_PIO_ABCDSR[1] Peripheral ABCD Select Register 0 **/
#define PIOC_PIO_ABCDSR[1]			MMIO32(PIOC_BASE + 0x74)
/** PIOC_PIO_IFSCDR Input Filter Slow Clock Disable Register **/
#define PIOC_PIO_IFSCDR			MMIO32(PIOC_BASE + 0x80)
/** PIOC_PIO_IFSCER Input Filter Slow Clock Enable Register **/
#define PIOC_PIO_IFSCER			MMIO32(PIOC_BASE + 0x84)
/** PIOC_PIO_IFSCSR Input Filter Slow Clock Status Register **/
#define PIOC_PIO_IFSCSR			MMIO32(PIOC_BASE + 0x88)
/** PIOC_PIO_SCDR Slow Clock Divider Debouncing Register **/
#define PIOC_PIO_SCDR			MMIO32(PIOC_BASE + 0x8c)
/** PIOC_PIO_PPDDR Pad Pull-down Disable Register **/
#define PIOC_PIO_PPDDR			MMIO32(PIOC_BASE + 0x90)
/** PIOC_PIO_PPDER Pad Pull-down Enable Register **/
#define PIOC_PIO_PPDER			MMIO32(PIOC_BASE + 0x94)
/** PIOC_PIO_PPDSR Pad Pull-down Status Register **/
#define PIOC_PIO_PPDSR			MMIO32(PIOC_BASE + 0x98)
/** PIOC_PIO_OWER Output Write Enable **/
#define PIOC_PIO_OWER			MMIO32(PIOC_BASE + 0xa0)
/** PIOC_PIO_OWDR Output Write Disable **/
#define PIOC_PIO_OWDR			MMIO32(PIOC_BASE + 0xa4)
/** PIOC_PIO_OWSR Output Write Status Register **/
#define PIOC_PIO_OWSR			MMIO32(PIOC_BASE + 0xa8)
/** PIOC_PIO_AIMER Additional Interrupt Modes Enable Register **/
#define PIOC_PIO_AIMER			MMIO32(PIOC_BASE + 0xb0)
/** PIOC_PIO_AIMDR Additional Interrupt Modes Disable Register **/
#define PIOC_PIO_AIMDR			MMIO32(PIOC_BASE + 0xb4)
/** PIOC_PIO_AIMMR Additional Interrupt Modes Mask Register **/
#define PIOC_PIO_AIMMR			MMIO32(PIOC_BASE + 0xb8)
/** PIOC_PIO_ESR Edge Select Register **/
#define PIOC_PIO_ESR			MMIO32(PIOC_BASE + 0xc0)
/** PIOC_PIO_LSR Level Select Register **/
#define PIOC_PIO_LSR			MMIO32(PIOC_BASE + 0xc4)
/** PIOC_PIO_ELSR Edge/Level Status Register **/
#define PIOC_PIO_ELSR			MMIO32(PIOC_BASE + 0xc8)
/** PIOC_PIO_FELLSR Falling Edge/Low-Level Select Register **/
#define PIOC_PIO_FELLSR			MMIO32(PIOC_BASE + 0xd0)
/** PIOC_PIO_REHLSR Rising Edge/High-Level Select Register **/
#define PIOC_PIO_REHLSR			MMIO32(PIOC_BASE + 0xd4)
/** PIOC_PIO_FRLHSR Fall/Rise - Low/High Status Register **/
#define PIOC_PIO_FRLHSR			MMIO32(PIOC_BASE + 0xd8)
/** PIOC_PIO_LOCKSR Lock Status **/
#define PIOC_PIO_LOCKSR			MMIO32(PIOC_BASE + 0xe0)
/** PIOC_PIO_WPMR Write Protection Mode Register **/
#define PIOC_PIO_WPMR			MMIO32(PIOC_BASE + 0xe4)
/** PIOC_PIO_WPSR Write Protection Status Register **/
#define PIOC_PIO_WPSR			MMIO32(PIOC_BASE + 0xe8)
/** PIOC_PIO_VERSION Version Register **/
#define PIOC_PIO_VERSION			MMIO32(PIOC_BASE + 0xfc)
/** PIOC_PIO_SCHMITT Schmitt Trigger Register **/
#define PIOC_PIO_SCHMITT			MMIO32(PIOC_BASE + 0x100)
/** PIOC_PIO_DRIVER I/O Drive Register **/
#define PIOC_PIO_DRIVER			MMIO32(PIOC_BASE + 0x118)
/** PIOC_PIO_PCMR Parallel Capture Mode Register **/
#define PIOC_PIO_PCMR			MMIO32(PIOC_BASE + 0x150)
/** PIOC_PIO_PCIER Parallel Capture Interrupt Enable Register **/
#define PIOC_PIO_PCIER			MMIO32(PIOC_BASE + 0x154)
/** PIOC_PIO_PCIDR Parallel Capture Interrupt Disable Register **/
#define PIOC_PIO_PCIDR			MMIO32(PIOC_BASE + 0x158)
/** PIOC_PIO_PCIMR Parallel Capture Interrupt Mask Register **/
#define PIOC_PIO_PCIMR			MMIO32(PIOC_BASE + 0x15c)
/** PIOC_PIO_PCISR Parallel Capture Interrupt Status Register **/
#define PIOC_PIO_PCISR			MMIO32(PIOC_BASE + 0x160)
/** PIOC_PIO_PCRHR Parallel Capture Reception Holding Register **/
#define PIOC_PIO_PCRHR			MMIO32(PIOC_BASE + 0x164)

/**@}*/


/** @defgroup pioc_pio_per PIOPER PIO Enable Register
@{*/

/** PIOC_PIO_PER_P31 PIO Enable **/
#define PIOC_PIO_PER_P31		(1 << 31)
/** PIOC_PIO_PER_P30 PIO Enable **/
#define PIOC_PIO_PER_P30		(1 << 30)
/** PIOC_PIO_PER_P29 PIO Enable **/
#define PIOC_PIO_PER_P29		(1 << 29)
/** PIOC_PIO_PER_P28 PIO Enable **/
#define PIOC_PIO_PER_P28		(1 << 28)
/** PIOC_PIO_PER_P27 PIO Enable **/
#define PIOC_PIO_PER_P27		(1 << 27)
/** PIOC_PIO_PER_P26 PIO Enable **/
#define PIOC_PIO_PER_P26		(1 << 26)
/** PIOC_PIO_PER_P25 PIO Enable **/
#define PIOC_PIO_PER_P25		(1 << 25)
/** PIOC_PIO_PER_P24 PIO Enable **/
#define PIOC_PIO_PER_P24		(1 << 24)
/** PIOC_PIO_PER_P23 PIO Enable **/
#define PIOC_PIO_PER_P23		(1 << 23)
/** PIOC_PIO_PER_P22 PIO Enable **/
#define PIOC_PIO_PER_P22		(1 << 22)
/** PIOC_PIO_PER_P21 PIO Enable **/
#define PIOC_PIO_PER_P21		(1 << 21)
/** PIOC_PIO_PER_P20 PIO Enable **/
#define PIOC_PIO_PER_P20		(1 << 20)
/** PIOC_PIO_PER_P19 PIO Enable **/
#define PIOC_PIO_PER_P19		(1 << 19)
/** PIOC_PIO_PER_P18 PIO Enable **/
#define PIOC_PIO_PER_P18		(1 << 18)
/** PIOC_PIO_PER_P17 PIO Enable **/
#define PIOC_PIO_PER_P17		(1 << 17)
/** PIOC_PIO_PER_P16 PIO Enable **/
#define PIOC_PIO_PER_P16		(1 << 16)
/** PIOC_PIO_PER_P15 PIO Enable **/
#define PIOC_PIO_PER_P15		(1 << 15)
/** PIOC_PIO_PER_P14 PIO Enable **/
#define PIOC_PIO_PER_P14		(1 << 14)
/** PIOC_PIO_PER_P13 PIO Enable **/
#define PIOC_PIO_PER_P13		(1 << 13)
/** PIOC_PIO_PER_P12 PIO Enable **/
#define PIOC_PIO_PER_P12		(1 << 12)
/** PIOC_PIO_PER_P11 PIO Enable **/
#define PIOC_PIO_PER_P11		(1 << 11)
/** PIOC_PIO_PER_P10 PIO Enable **/
#define PIOC_PIO_PER_P10		(1 << 10)
/** PIOC_PIO_PER_P9 PIO Enable **/
#define PIOC_PIO_PER_P9		(1 << 9)
/** PIOC_PIO_PER_P8 PIO Enable **/
#define PIOC_PIO_PER_P8		(1 << 8)
/** PIOC_PIO_PER_P7 PIO Enable **/
#define PIOC_PIO_PER_P7		(1 << 7)
/** PIOC_PIO_PER_P6 PIO Enable **/
#define PIOC_PIO_PER_P6		(1 << 6)
/** PIOC_PIO_PER_P5 PIO Enable **/
#define PIOC_PIO_PER_P5		(1 << 5)
/** PIOC_PIO_PER_P4 PIO Enable **/
#define PIOC_PIO_PER_P4		(1 << 4)
/** PIOC_PIO_PER_P3 PIO Enable **/
#define PIOC_PIO_PER_P3		(1 << 3)
/** PIOC_PIO_PER_P2 PIO Enable **/
#define PIOC_PIO_PER_P2		(1 << 2)
/** PIOC_PIO_PER_P1 PIO Enable **/
#define PIOC_PIO_PER_P1		(1 << 1)
/** PIOC_PIO_PER_P0 PIO Enable **/
#define PIOC_PIO_PER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_pdr PIOPDR PIO Disable Register
@{*/

