grevaillot/svd_tools/headers/ATSAMV71Q19/pioc.h
/** PIOC_PIO_PCIER_RXBUFF Reception Buffer Full Interrupt Enable **/
#define PIOC_PIO_PCIER_RXBUFF		(1 << 3)
/** PIOC_PIO_PCIER_ENDRX End of Reception Transfer Interrupt Enable **/
#define PIOC_PIO_PCIER_ENDRX		(1 << 2)
/** PIOC_PIO_PCIER_OVRE Parallel Capture Mode Overrun Error Interrupt Enable **/
#define PIOC_PIO_PCIER_OVRE		(1 << 1)
/** PIOC_PIO_PCIER_DRDY Parallel Capture Mode Data Ready Interrupt Enable **/
#define PIOC_PIO_PCIER_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_pcidr PIOPCIDR Parallel Capture Interrupt Disable Register
@{*/

/** PIOC_PIO_PCIDR_RXBUFF Reception Buffer Full Interrupt Disable **/
#define PIOC_PIO_PCIDR_RXBUFF		(1 << 3)
/** PIOC_PIO_PCIDR_ENDRX End of Reception Transfer Interrupt Disable **/
#define PIOC_PIO_PCIDR_ENDRX		(1 << 2)
/** PIOC_PIO_PCIDR_OVRE Parallel Capture Mode Overrun Error Interrupt Disable **/
#define PIOC_PIO_PCIDR_OVRE		(1 << 1)
/** PIOC_PIO_PCIDR_DRDY Parallel Capture Mode Data Ready Interrupt Disable **/
#define PIOC_PIO_PCIDR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_pcimr PIOPCIMR Parallel Capture Interrupt Mask Register
@{*/

/** PIOC_PIO_PCIMR_RXBUFF Reception Buffer Full Interrupt Mask **/
#define PIOC_PIO_PCIMR_RXBUFF		(1 << 3)
/** PIOC_PIO_PCIMR_ENDRX End of Reception Transfer Interrupt Mask **/
#define PIOC_PIO_PCIMR_ENDRX		(1 << 2)
/** PIOC_PIO_PCIMR_OVRE Parallel Capture Mode Overrun Error Interrupt Mask **/
#define PIOC_PIO_PCIMR_OVRE		(1 << 1)
/** PIOC_PIO_PCIMR_DRDY Parallel Capture Mode Data Ready Interrupt Mask **/
#define PIOC_PIO_PCIMR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_pcisr PIOPCISR Parallel Capture Interrupt Status Register
@{*/

/** PIOC_PIO_PCISR_OVRE Parallel Capture Mode Overrun Error **/
#define PIOC_PIO_PCISR_OVRE		(1 << 1)
/** PIOC_PIO_PCISR_DRDY Parallel Capture Mode Data Ready **/
#define PIOC_PIO_PCISR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_pcrhr PIOPCRHR Parallel Capture Reception Holding Register
@{*/


#define PIOC_PIO_PCRHR_RDATA_SHIFT		0
#define PIOC_PIO_PCRHR_RDATA_MASK		0xffffffff
/** @defgroup pioc_pio_pcrhr_rdata RDATA Parallel Capture Mode Reception Data
@{*/
/**@}*/


/**@}*/
